import React from "react";
import GameInfoItem from "./GameInfoItem";

export default {
  title: "molecules/GameInfoItem",
  component: GameInfoItem,
};

const Template = (args) => <GameInfoItem {...args} />;

export const Primary = Template.bind({});
Primary.args = {
  title: "제목1",
  text: "품었기 있는 구하지 하는 청춘이 사는가 것이다. 희망의 보배를 봄바람을 뜨고, 피는 반짝이는 남는 칼이다. 영원히 천고에 이상, 않는 아름다우냐? 밝은 몸이 같으며, 실현에 것은 말이다. 가진 영락과 이 모래뿐일 돋고, 약동하다. 지혜는 끓는 같으며, 말이다. 황금시대의 천자만홍이 스며들어 것이다. 그들의 구하지 가치를 수 사랑의 불어 뿐이다. 사람은 그러므로 열매를 원질이 있는 위하여서, 그리하였는가? 것이다.보라, 그것을 커다란 얼마나 밝은 인도하겠다는 그리하였는가? 갑 아니더면, 있으며, 힘있다. 산야에 그러므로 설레는 싹이 구하지 품으며, 붙잡아 인생의 이상의 듣는다. 돋고, 인생을 꽃이 방황하여도, 것이다.보라, 피에 운다. 풀이 튼튼하며, 품으며, 남는 기쁘며, 것이다. 그들에게 청춘의 주는 이것을 설산에서 트고, 피는 말이다. 속에서 무엇을 크고 꽃이 시들어 수 황금시대다. 이것을 이것은 끓는 봄날의 같이, 굳세게 사막이다. 바로 우리 튼튼하며, 용감하고 커다란 있는가? 그러므로 위하여 그러므로 이상, 인생에 때에, 가장 아름다우냐? 그러므로 황금시대의 할지니, 착목한는 두손을 피가 것은 끓는다.없으면 두손을 풀이 풀이 때에, 천고에 창공에 것은 실현에 교향악이다. 품었기 역사를 이상의 길을 풍부하게 얼마나 되려니와, 못할 무엇을 힘있다. 뼈 충분히 주며, 얼마나 쓸쓸하랴? 인간에 행복스럽고 풀이 인간은 미인을 그들을 같이 있는가? 열매를 희망의 붙잡아 이것이다. 못하다 것이다.보라, 살 길을 주며, 별과 끓는다. 실현에 꽃이 이상은 속에 실로 그러므로 인간의 온갖 뼈 봄바람이다. 수 우리 끝에 무엇을 품으며, 아름다우냐? 고행을 지혜는 힘차게 그들에게 길을 작고 때문이다.",
};

// imgPath:
//     "https://cdn.akamai.steamstatic.com/steam/apps/10/header.jpg?t=1602535893",
//   videoPath:
//     "http://cdn.akamai.steamstatic.com/steam/apps/912/movie480.mp4?t=1512411140",
